[
  {
    "address": "123 Main St",
    "address2": "Suite 200",
    "ceo": "John Smith",
    "city": "New York",
    "companyName": "ABC Inc.",
    "country": "USA",
    "employees": 500,
    "exchangeCode": "NYSE",
    "longDescription": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. It also sells various related services. In addition, the company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. Further, it provides AppleCare support and cloud services store services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts. Additionally, the company offers various services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was incorporated in 1977 and is headquartered in Cupertino, California.",
    "phone": "555-1234",
    "shortDescription": "ABC Inc. provides innovative solutions for businesses.",
    "state": "NY",
    "symbol": "AAPL",
    "website": "http://www.abcinc.com",
    "zip": "10001",
    "id": "COMPANY-1"
  },
  {
    "address": "1600 Amphitheatre Parkway",
    "address2": null,
    "ceo": "Sundar Pichai",
    "city": "Mountain View",
    "companyName": "Alphabet Inc.",
    "country": "USA",
    "employees": 139995,
    "exchangeCode": "NASDAQ",
    "longDescription": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, hardware, Google Maps, Google Play, Search, and YouTube, as well as technical infrastructure; and digital content. The Google Cloud segment offers infrastructure and data analytics platforms, collaboration tools, and other services for enterprise customers. The Other Bets segment sells internet and TV services, as well as licensing and research and development services. Alphabet Inc. was founded in 1998 and is headquartered in Mountain View, California.",
    "phone": "+1-650-253-0000",
    "shortDescription": "Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America.",
    "state": "CA",
    "symbol": "GOOG",
    "website": "https://abc.xyz/",
    "zip": "94043",
    "id": "COMPANY"
  },
  {
    "address": "One Microsoft Way",
    "address2": null,
    "ceo": "Satya Nadella",
    "city": "Redmond",
    "companyName": "Microsoft Corporation",
    "country": "USA",
    "employees": 181000,
    "exchangeCode": "NASDAQ",
    "longDescription": "Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide. Its Productivity and Business Processes segment offers Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, and Skype for Business, as well as related Client Access Licenses (CAL); Skype, Outlook.com, and OneDrive; LinkedIn that includes Talent, Learning, Sales, and Marketing solutions, as well as premium subscriptions for recruiters, professionals, and salespeople; and Dynamics 365, a set of cloud-based and on-premises business solutions for small and medium businesses, large organizations, and divisions of enterprises. Its Intelligent Cloud segment licenses SQL and Windows Servers, Visual Studio, System Center, and related CALs; GitHub that provides a collaboration platform and code hosting service for developers; and Azure, a cloud platform. It also offers support services and Microsoft consulting services to assist customers in developing, deploying, and managing Microsoft server and desktop solutions; and training and certification to developers and IT professionals on various Microsoft products.",
    "phone": "425-882-8080",
    "shortDescription": "Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide.",
    "state": "CA",
    "symbol": "MSFT",
    "website": "https://www.microsoft.com",
    "zip": "98052-6399",
    "id": "COMPANY"
  },
  {
    "address": "3500 Deer Creek Rd",
    "address2": null,
    "ceo": "Elon Musk",
    "city": "Palo Alto",
    "companyName": "Tesla, Inc.",
    "country": "USA",
    "employees": 70757,
    "exchangeCode": "NASDAQ",
    "longDescription": "Tesla, Inc. designs, develops, manufactures, and sells electric vehicles, and energy generation and storage systems in the United States, China, Netherlands, Norway, and internationally. The company operates in two segments, Automotive; and Energy Generation and Storage. The Automotive segment offers electric vehicles, such as Model 3, Model Y, Model S, and Model X. The Energy Generation and Storage segment provides energy storage products, such as Powerwall, Powerpack, and Megapack; and solar products comprising solar panels and solar roofs for residential and commercial customers. The company also produces and sells electric vehicle powertrain components and systems to other manufacturers; and services for electric vehicles through its company-owned service locations, and Tesla mobile service technicians, as well as sells used vehicles. Tesla, Inc. was founded in 2003 and is headquartered in Palo Alto, California.",
    "phone": "650-681-5100",
    "shortDescription": "Tesla, Inc. designs, develops, manufactures, and sells electric vehicles, and energy generation and storage systems.",
    "state": "CA",
    "symbol": "TSLA",
    "website": "https://www.tesla.com/",
    "zip": "94304",
    "id": "COMPANY"
  },
  {
    "address": "1 Hacker Way",
    "address2": null,
    "ceo": "Mark Zuckerberg",
    "city": "Menlo Park",
    "companyName": "Facebook Inc.",
    "country": "USA",
    "employees": 71448,
    "exchangeCode": "NASDAQ",
    "longDescription": "Facebook, Inc. operates as a social networking company worldwide. The company engages in the development of social media applications for people to connect through mobile devices, personal computers, and other surfaces. It enables users to share opinions, ideas, photos, videos, and other activities online. The firm's products include Facebook, Instagram, Messenger, WhatsApp, and Oculus. The company was founded in 2004 and is headquartered in Menlo Park, California.",
    "phone": "+1-650-308-7300",
    "shortDescription": "Facebook, Inc. operates as a social networking company worldwide.",
    "state": "CA",
    "symbol": "FB",
    "website": "https://www.facebook.com/",
    "zip": "94025",
    "id": "COMPANY"
  },
  {
    "address": "1 Bowerman Dr",
    "address2": "",
    "ceo": "John J. Donahoe",
    "city": "Beaverton",
    "companyName": "Nike, Inc.",
    "country": "USA",
    "employees": 75300,
    "exchangeCode": "NYSE",
    "longDescription": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, and accessories worldwide. The company offers NIKE brand products in six categories: running, NIKE basketball, the Jordan brand, football, training, and sportswear. It also markets products designed for kids, as well as for other athletic and recreational uses, such as cricket, lacrosse, tennis, volleyball, wrestling, walking, and outdoor activities. In addition, the company sells sports apparel and accessories, as well as markets apparel with licensed college and professional team and league logos.",
    "phone": "+1 503-671-6453",
    "shortDescription": "NIKE, Inc., designs, develops, markets, and sells athletic footwear, apparel, equipment, and accessories worldwide.",
    "state": "OR",
    "symbol": "NKE",
    "website": "https://www.nike.com/",
    "zip": "97005",
    "id": "COMPANY"
  },
  {
    "address": "383 Madison Avenue",
    "address2": null,
    "ceo": "Jamie Dimon",
    "city": "New York",
    "companyName": "JPMorgan Chase & Co.",
    "country": "USA",
    "employees": 252539,
    "exchangeCode": "NYSE",
    "longDescription": "JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through four segments: Consumer & Community Banking (CCB), Corporate & Investment Bank (CIB), Commercial Banking (CB), and Asset & Wealth Management (AWM). The CCB segment offers s deposit, investment and lending products, payments, and services to consumers; lending, deposit, and cash management and payment solutions to small businesses; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit card, auto loan, and leasing services. The CIB segment provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt markets capital-raising services, as well as loan origination and syndication; payments and cross-border financing; and cash and derivative instruments, risk management solutions, prime brokerage, and research. This segment also offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. The CB segment provides financial solutions, including lending, payments, investment banking, and asset management to small business, large and midsized companies, local governments, and nonprofit clients; and commercial real estate banking services to investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. The AWM segment offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, trusts and estates, loans, mortgages, deposits, and investment management products. The company also provides ATM, online and mobile, and telephone banking services. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.",
    "phone": "1-212-270-6000",
    "shortDescription": "JPMorgan Chase & Co. is a leading global financial services firm and one of the largest banking institutions in the United States.",
    "state": "NY",
    "symbol": "JPM",
    "website": "https://www.jpmorganchase.com",
    "zip": "10179",
    "id": "COMPANY"
  },
  {
    "address": "2775 Sanders Rd",
    "address2": "",
    "ceo": "Alfred F Kelly Jr",
    "city": "Northbrook",
    "companyName": "Visa Inc.",
    "country": "USA",
    "employees": 21000,
    "exchangeCode": "NYSE",
    "longDescription": "Visa Inc. operates as a payments technology company worldwide. The company facilitates commerce through the transfer of value and information among consumers, merchants, financial institutions, businesses, strategic partners, and government entities. It operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. In addition, the company offers card products, as well as value-added services. It provides its services under the Visa, Visa Electron, Interlink, V PAY, and PLUS brands. Visa Inc. has a strategic partnership with NovoPayment to enable financial institutions and merchants to deploy Visa's digital solutions in Latin America and the Caribbean. The company was founded in 1958 and is headquartered in San Francisco, California.",
    "phone": "+1-650-432-3200",
    "shortDescription": "Visa Inc. operates as a payments technology company worldwide.",
    "state": "CA",
    "symbol": "V",
    "website": "https://usa.visa.com/",
    "zip": "60062",
    "id": "COMPANY"
  },
  {
    "address": "One Coca-Cola Plaza",
    "address2": null,
    "ceo": "James Quincey",
    "city": "Atlanta",
    "companyName": "The Coca-Cola Company",
    "country": "USA",
    "employees": 72700,
    "exchangeCode": "NYSE",
    "longDescription": "The Coca-Cola Company, a beverage company, manufactures, markets, and sells various nonalcoholic beverages worldwide. The company provides sparkling soft drinks; flavored and enhanced water, and sports drinks; juice, dairy, and plant\u0096based beverages; tea and coffee; and energy drinks. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers, such as restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke/Coca-Cola Light, Coca-Cola Zero Sugar, Fanta, Fresca, Schweppes, Sprite, Thums Up, Aquarius, Ciel, dogadan, Dasani, glacéau smartwater, glacéau vitaminwater, Ice Dew, I LOHAS, Powerade, Topo Chico, AdeS, Del Valle, fairlife, innocent, Minute Maid, Minute Maid Pulpy, Simply, Ayataka, BODYARMOR, Costa, FUZE TEA, Georgia, and Gold Peak brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.",
    "phone": "404-676-2121",
    "shortDescription": "The Coca-Cola Company manufactures, markets, and sells various nonalcoholic beverages worldwide.",
    "state": "GA",
    "symbol": "KO",
    "website": "https://www.coca-colacompany.com",
    "zip": "30313",
    "id": "COMPANY"
  },
  {
    "address": "2788 San Tomas Expressway",
    "address2": null,
    "ceo": "Jen-Hsun Huang",
    "city": "Santa Clara",
    "companyName": "NVIDIA Corporation",
    "country": "USA",
    "employees": 18153,
    "exchangeCode": "NASDAQ",
    "longDescription": "NVIDIA Corporation provides graphics, and compute and networking solutions in the United States, Taiwan, China, and internationally. The company's Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building 3D designs and virtual worlds. Its Compute & Networking segment provides Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; cryptocurrency mining processors; Jetson for robotics and other embedded platforms; and NVIDIA AI Enterprise and other software. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, independent software vendors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. It has a strategic collaboration with Kroger Co. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.\n\n",
    "phone": "408-486-2000",
    "shortDescription": "NVIDIA Corporation operates as a visual computing company worldwide.",
    "state": "CA",
    "symbol": "NVDA",
    "website": "https://www.nvidia.com",
    "zip": "95051",
    "id": "COMPANY"
  },
  {
    "address": "One Procter & Gamble Plaza",
    "address2": null,
    "ceo": "David Taylor",
    "city": "Cincinnati",
    "companyName": "Procter & Gamble Company (The)",
    "country": "USA",
    "employees": 100000,
    "exchangeCode": "NYSE",
    "longDescription": "The Procter & Gamble Company provides branded consumer packaged goods worldwide. It operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, and SK-II brands. The Grooming segment provides shave care products and appliances under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, taped diapers, and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. The company sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.",
    "phone": "513-983-1100",
    "shortDescription": "The Procter & Gamble Company provides branded consumer packaged goods to consumers worldwide.",
    "state": "OH",
    "symbol": "PG",
    "website": "https://us.pg.com",
    "zip": "45202",
    "id": "COMPANY"
  },
  {
    "address": "1095 Avenue of the Americas",
    "address2": null,
    "ceo": "Hans Vestberg",
    "city": "New York",
    "companyName": "Verizon Communications Inc.",
    "country": "USA",
    "employees": 132800,
    "exchangeCode": "NYSE",
    "longDescription": "Verizon Communications Inc. offers communications, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. Its Consumer segment provides postpaid and prepaid service plans; internet access on notebook computers and tablets; wireless equipment, including smartphones and other handsets; and wireless-enabled internet devices, such as tablets, laptop computers and netbooks, and other wireless-enabled connected devices, such as smart watches and other wearables. It also provides residential fixed connectivity solutions, including internet, video, and voice services; and sells network access to mobile virtual network operators. Its Business segment provides network connectivity products and services; private network solutions; internet protocol-based voice services; virtual network services; contact center solutions; security and managed network services; and IT infrastructure services for large and small businesses, and governmental entities. Its Global Media and Entertainment segment offers pay television, video content, wireless phone and internet services, and other entertainment products under the Verizon, Yahoo, and AOL brands to customers in the United States. It also provides location-based services; and digital advertising and media services platforms. The company has a collaboration with Walt Disney Studios. Verizon Communications Inc. was founded in 1983 and is headquartered in New York, New York.",
    "phone": "212-395-1000",
    "shortDescription": "Verizon Communications Inc. offers communications, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide.",
    "state": "NY",
    "symbol": "VZ",
    "website": "https://www.verizon.com",
    "zip": "10036",
    "id": "COMPANY"
  },
  {
    "address": "2211 North First Street",
    "address2": null,
    "ceo": "Daniel Schulman",
    "city": "San Jose",
    "companyName": "PayPal Holdings, Inc.",
    "country": "USA",
    "employees": 24300,
    "exchangeCode": "NASDAQ",
    "longDescription": "PayPal Holdings, Inc. operates as a technology platform and digital payments company that enables digital and mobile payments on behalf of consumers and merchants worldwide. Its payment solutions include PayPal, PayPal Credit, Braintree, Venmo, Xoom, and iZettle products. The company's payments platform allows consumers to send and receive payments, withdraw funds to their bank accounts, and hold balances in their PayPal accounts in various currencies. It also offers gateway services that enable merchants to accept payments online with credit or debit cards, as well as digital wallets. PayPal Holdings, Inc. was founded in 1998 and is headquartered in San Jose, California.",
    "phone": "408-967-1000",
    "shortDescription": "PayPal Holdings, Inc. operates as a technology platform and digital payments company that enables digital and mobile payments on behalf of consumers and merchants worldwide.",
    "state": "CA",
    "symbol": "PYPL",
    "website": "https://www.paypal.com",
    "zip": "95131",
    "id": "COMPANY"
  },
  {
    "address": "500 Oracle Parkway",
    "address2": null,
    "ceo": "Safra A. Catz",
    "city": "Redwood City",
    "companyName": "Oracle Corporation",
    "country": "USA",
    "employees": 138000,
    "exchangeCode": "NYSE",
    "longDescription": "Oracle Corporation provides products and services that address enterprise information technology environments worldwide. Its cloud and license business engages in the sale, marketing, and delivery of its applications and infrastructure technologies through cloud and on-premise deployment models, including cloud services and license support; and cloud license and on-premise license. The company's hardware business provides a range of hardware products for businesses, including servers, storage, networking, virtualization software, operating systems, and management software to manage large scale databases and storage systems. Its services business includes the Oracle Advanced Customer Services, Oracle Managed Cloud Services, and Oracle Professional Services that enable customers to maximize their IT investments and drive business outcomes. The company also invests in advanced technologies, such as artificial intelligence (AI), machine learning, blockchain, and Internet of Things (IoT) capabilities, to design and offer products and services that meet the evolving needs of customers and partners. Oracle Corporation was founded in 1977 and is headquartered in Redwood City, California.",
    "phone": "+1-650-506-7000",
    "shortDescription": "Oracle Corporation provides products and services that address enterprise information technology environments worldwide.",
    "state": "CA",
    "symbol": "ORCL",
    "website": "https://www.oracle.com",
    "zip": "94065",
    "id": "COMPANY"
  },
  {
    "address": "100 Winchester Circle",
    "address2": null,
    "ceo": "Reed Hastings",
    "city": "Los Gatos",
    "companyName": "Netflix, Inc.",
    "country": "USA",
    "employees": 11700,
    "exchangeCode": "NASDAQ",
    "longDescription": "Netflix, Inc. provides subscription streaming entertainment service. It offers TV series, documentaries, and feature films across various genres and languages. The company provides members the ability to receive streaming content through a host of Internet-connected devices, including TVs, digital video players, television set-top boxes, and mobile devices. It also produces original content. The company was founded by Reed Hastings and Marc Randolph in 1997 and is headquartered in Los Gatos, CA.",
    "phone": "+1-408-540-3700",
    "shortDescription": "Netflix, Inc. provides subscription streaming entertainment service.",
    "state": "CA",
    "symbol": "NFLX",
    "website": "https://www.netflix.com",
    "zip": "95032",
    "id": "COMPANY"
  },
  {
    "address": "345 Park Avenue",
    "address2": null,
    "ceo": "Shantanu Narayen",
    "city": "San Jose",
    "companyName": "Adobe Inc.",
    "country": "USA",
    "employees": 22779,
    "exchangeCode": "NASDAQ",
    "longDescription": "Adobe Inc. operates as a diversified software company worldwide. Its Digital Media segment provides tools and solutions that enable individuals, small and medium businesses, and enterprises to create, publish, promote, and monetize their digital content. Its flagship product is Creative Cloud, a subscription service that allows customers to download and access the latest versions of its creative products. This segment serves traditional content creators, Web application developers, and digital media professionals, as well as their management in marketing departments and agencies, companies, and publishers. The company's Digital Experience segment offers solutions for how digital advertising and marketing are created, managed, executed, measured, and optimized. This segment provides analytics, social marketing, targeting, media optimization, digital experience management, cross-channel campaign management, marketing automation, audience management, and video delivery and monetization solutions to enterprise clients, including marketers, advertisers, agencies, publishers, merchandisers, Web analysts, and data scientists. Its Publishing segment offers products and services, such as eLearning solutions, technical document publishing, web conferencing, document and forms platform, and web application development. The company markets and licenses its products and services directly to enterprise customers through its sales force, as well as to end-users through app stores and through its Website at adobe.com. It also distributes products and services through a network of distributors, value-added resellers, systems integrators, independent software vendors, retailers, and OEMs. Adobe Inc. has a strategic partnership with NVIDIA Corporation. The company was founded in 1982 and is headquartered in San Jose, California.",
    "phone": "408-536-6000",
    "shortDescription": "Adobe Inc. operates as a diversified software company worldwide.",
    "state": "CA",
    "symbol": "ADBE",
    "website": "https://www.adobe.com",
    "zip": "95110-2704",
    "id": "COMPANY"
  }
]

